Public Member Functions | List of all members
API_IClassificationItemEventHandler Class Reference
Notifications Manager
The base class you need to inherit from in case you want to handle API_ClassificationItem events. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IClassificationItemEventHandler:
 Public Member Functions
virtual GS::UniString  | GetName () const override final
virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const override final
 virtual GS::UniString  | GetName () const =0
 virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const =0
 Public Member Functions inherited from API_IObjectEventHandler
 virtual void  | OnCreated (const GS::HashSet< API_Guid > &) const
 virtual void  | OnModified (const GS::HashSet< API_Guid > &) const
 virtual void  | OnDeleted (const GS::HashSet< API_Guid > &) const
Detailed Description
The base class you need to inherit from in case you want to handle API_ClassificationItem events.
Since
Archicad 26
Member Function Documentation
◆ Dispatch()
 virtual void API_IClassificationItemEventHandler::Dispatch  |  ( |  const API_IEventNotifier &  |  eventNotfier | ) |   const
inlinefinaloverridevirtual
Implements API_IEventHandler.
◆ GetName()
 virtual GS::UniString API_IClassificationItemEventHandler::GetName  |  ( |   | ) |   const
inlinefinaloverridevirtual
Implements API_IEventHandler.